Autodesk.Revit.DB.Structure.AnalyticalOpening.IsCurveLoopValidForAnalyticalOpening(Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if curve loop is valid for Analytical Opening.
loop:
The curve loop to be checked.
aDoc:
Revit document.
panelId:
ElementId of the AnalyticalPanel on which we create the Opening.
Returns:
Returns true if curve loop is ok, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalOpening.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.ElementId)
Creates a new instance of an Analytical Opening within the project.
Remarks:
CurveLoop must be planar, not self-intersecting and in the same plane as the Analytical Panel.
CurveLoop must intersect or to be inside the AnalyticalPanel contour.
PanelId must be the ElementId of an AnalyticalPanel otherwise an exception is thrown.
aDoc:
Revit document.
curveLoop:
CurveLoop for the Analytical Opening.
panelId:
ElementId of the AnalyticalPanel on which we create the Opening.
Returns:
The newly created AnalyticalOpening instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the following requirements is not satisfied :
- curve loop curveLoop is not planar
- curve loop curveLoop is self-intersecting
- curve loop curveLoop contains zero length curves
- curve loop curveLoop is not inside or does not intersect the AnalyticalPanel on which we want to create the Opening.
- panelId is not the ElementId of an AnalyticalPanel
- curve loop curveLoop is not in the same plane as the Analytical Panel
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalOpening.PanelId
ElementId of the AnalyticalPanel parent.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalOpening
An element that represents an Opening in an Analytical Panel element.
Remarks:
It can cut only one Analytical Panel at a time.
Since:
2023